EDT/УТ/src/Reports/Enter_2/Enter_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Enter_2</name>
</mdclass:Report>

EDT/УТ/src/AccumulationRegisters/ЗакрытыеЗаказы/ЗакрытыеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗакрытыеЗаказы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаОценочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БанковскаяКомиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовоеОбслуживание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЧастичногоВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоКлиентовНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскоеВознаграждение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСДЧистые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховойСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабораПоЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгруженныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОценочнаяПоТоварно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПодъемаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоТарифицируемыхРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВознаграждениеАгентаПоПредоплаченнымЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФрахтЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Списание</name>
    <type>
      <types>DocumentRef.СписаниеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оприходование</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозврата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтклоненияЗаказа</name>
    <comment>Причина отклонения заказа в системе</comment>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалПриёма</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодъемныйБрейк</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Enums/ТипыЗаказов/ТипыЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗаказов</name>
  <enumValues>
    <name>Доставка</name>
  </enumValues>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>Забор</name>
  </enumValues>
  <enumValues>
    <name>Фрахт</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>Обмен</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Reports/Enter_2/ObjectModule.bsl
Процедура Сформировать(Таб, НачПериода, КонПериода, Контрагент) Экспорт
	Таб.Очистить();
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	МИНИМУМ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Дата) КАК Дата,
	            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ГодДоставки,
	            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК МесяцДоставки,
	            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки) КАК ДеньДоставки
	            |ПОМЕСТИТЬ ВТОплаты
	            |ИЗ
	            |	Документ.ПлатежноеПоручениеИсходящее.ТаблицаДатОплат КАК ПлатежноеПоручениеИсходящееТаблицаДатОплат
	            |ГДЕ
	            |	ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Проведен = ИСТИНА
	            |	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.Ссылка.Контрагент = &Контрагент
	            |	И ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки МЕЖДУ &НачПериода И &КонПериода
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	ГОД(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
	            |	МЕСЯЦ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки),
	            |	ДЕНЬ(ПлатежноеПоручениеИсходящееТаблицаДатОплат.ДатаДоставки)
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ЗакрытыеЗаказы.ИнтернетМагазин,
	            |	ЗакрытыеЗаказы.Реализация,
	            |	ЗакрытыеЗаказы.Реализация.Номер КАК НомерЗаказа,
	            |	ЗакрытыеЗаказы.Реализация.НомерВнешнегоЗаказа КАК НомерВнешнегоЗаказа,
	            |	ЗакрытыеЗаказы.Период КАК ДатаДоставки,
	            |	ЗакрытыеЗаказы.ТипЗаказа КАК ВидРабот,
	            |	ЗакрытыеЗаказы.Доставка.ДатаСоздания КАК ДатаЗабора,
	            |	ЗакрытыеЗаказы.СуммаОценочная КАК СтоимостьГруза,
	            |	ЗакрытыеЗаказы.СуммаЧастичногоВозврата КАК СтоимостьВозврата,
	            |	ЗакрытыеЗаказы.УслугиСД + ЗакрытыеЗаказы.БанковскаяКомиссия + ЗакрытыеЗаказы.КассовоеОбслуживание КАК АгентскоеВознаграждение,
	            |	ВЫБОР
	            |		КОГДА ЗакрытыеЗаказы.ТипОплаты = ЗНАЧЕНИЕ(Справочник.ТипыОплат.Наличные)
	            |			ТОГДА ЗакрытыеЗаказы.ОплаченоКлиентовНал
	            |		ИНАЧЕ 0
	            |	КОНЕЦ КАК СуммаПолученнаяОтПокупателей,
	            |	ЗакрытыеЗаказы.СуммаДоставкиДоМКАД + ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД КАК СтоимостьДоставки,
	            |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПеречисления,
	            |	ЗакрытыеЗаказы.СтатусЗаказа КАК СтатусДоставки,
	            |	ГОД(ЗакрытыеЗаказы.Период) КАК ГодДоставки,
	            |	МЕСЯЦ(ЗакрытыеЗаказы.Период) КАК МесяцДоставки,
	            |	ДЕНЬ(ЗакрытыеЗаказы.Период) КАК ДеньДоставки
	            |ПОМЕСТИТЬ ВТДоставки
	            |ИЗ
	            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	            |ГДЕ
	            |	ЗакрытыеЗаказы.Период МЕЖДУ &НачПериода И &КонПериода
	            |	И ЗакрытыеЗаказы.ИнтернетМагазин = &Контрагент
	            |	И ЗакрытыеЗаказы.ТипЗаказа = &Доставка
	            |	И ЗакрытыеЗаказы.СтатусИнтернетМагазина <> ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказОтклонен)
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТДоставки.ИнтернетМагазин,
	            |	ВТДоставки.Реализация,
	            |	ВТДоставки.НомерЗаказа Как НЗ,
	            |	ВТДоставки.НомерВнешнегоЗаказа КАК НомерЗаказа,
	            |	НАЧАЛОПЕРИОДА(ВТДоставки.ДатаДоставки, ДЕНЬ) КАК ДатаДоставки,
	            |	ВТДоставки.ВидРабот,
	            |	ВТДоставки.ДатаЗабора,
	            |	ВТДоставки.СтоимостьГруза,
	            |	ВТДоставки.СтоимостьВозврата,
	            |	ВТДоставки.АгентскоеВознаграждение,
	            |	ВТДоставки.СуммаПолученнаяОтПокупателей КАК Сумма,
	            |	ВТДоставки.СтоимостьДоставки,
	            |	ВТДоставки.СтатусДоставки,
	            |	ВТОплаты.Дата КАК ДатаПлатежа
	            |ИЗ
	            |	ВТДоставки КАК ВТДоставки
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТОплаты КАК ВТОплаты
	            |		ПО ВТДоставки.ГодДоставки = ВТОплаты.ГодДоставки
	            |			И ВТДоставки.МесяцДоставки = ВТОплаты.МесяцДоставки
	            |			И ВТДоставки.ДеньДоставки = ВТОплаты.ДеньДоставки
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	НомерВнешнегоЗаказа
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТОплаты
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |УНИЧТОЖИТЬ ВТДоставки";
	Зап.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));			
	Зап.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
	Зап.УстановитьПараметр("Контрагент", Контрагент);
	Зап.УстановитьПараметр("Доставка", Перечисления.ТипыЗаказов.Доставка);
	
	Рез = Зап.Выполнить().Выгрузить();
	
	
	Мак = ПолучитьМакет("Макет");
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	ОблСтр = Мак.ПолучитьОбласть("Строка");
	Таб.Вывести(ОблШ);
		
	Для Каждого Тек Из Рез Цикл
		ЗаполнитьЗначенияСвойств(ОблСтр.параметры, Тек);
		Если Тек.Сумма = 0 Тогда
			ОблСтр.параметры.ДатаПлатежа = "";
		КонецеСли;	
		Таб.Вывести(ОблСтр);
		
	КонецЦикла;
	
	Таб.ПолеСлева = 3;
	Таб.ПолеСнизу = 3;
	Таб.ПолеСверху = 3;
	Таб.ПолеСправа = 3;
	Таб.Автомасштаб = Истина;
	Таб.ТолькоПросмотр = 1;
	Таб.ИмяПараметровПечати = "Энтер_3";
КонецПроцедуры
